In [34]:
import pandas as pd
from datetime import datetime

In [26]:
df = pd.read_csv('new.csv', sep='\t')
df.head()

,Unnamed: 0,warehouse_id,name,city,date_open,date_close
0,1,1,Storage Facility #1,Moscow,2019-06-06T00:00:00.000Z,<NULL>
1,2,2,Storage Facility #2,Moscow,2019-11-14T00:00:00.000Z,<NULL>
2,3,3,Storage Facility #3,Moscow,2012-07-05T00:00:00.000Z,<NULL>
3,4,4,Storage Facility #4,Moscow,2019-10-15T00:00:00.000Z,<NULL>
4,5,5,Storage Facility #5,Moscow,2015-06-17T00:00:00.000Z,<NULL>

In [27]:
df.columns

Index(['Unnamed: 0', 'warehouse_id', 'name', 'city', 'date_open',
       'date_close'],
      dtype='object')

In [28]:
df = df.drop(['Unnamed: 0'], axis=1)

In [29]:
df.head()

,warehouse_id,name,city,date_open,date_close
0,1,Storage Facility #1,Moscow,2019-06-06T00:00:00.000Z,<NULL>
1,2,Storage Facility #2,Moscow,2019-11-14T00:00:00.000Z,<NULL>
2,3,Storage Facility #3,Moscow,2012-07-05T00:00:00.000Z,<NULL>
3,4,Storage Facility #4,Moscow,2019-10-15T00:00:00.000Z,<NULL>
4,5,Storage Facility #5,Moscow,2015-06-17T00:00:00.000Z,<NULL>

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   warehouse_id  300 non-null    int64
 1   name          300 non-null    object
 2   city          300 non-null    object
 3   date_open     300 non-null    object
 4   date_close    300 non-null    object
dtypes: int64(1), object(4)
memory usage: 11.8+ KB

In [32]:
df['date_open'] = pd.to_datetime(df['date_open'], format='%Y-%m-%dT%H:%M:%S.%fZ')
df.head()

   warehouse_id                 name    city  date_open date_close
0             1  Storage Facility #1  Moscow 2019-06-06     <NULL>
1             2  Storage Facility #2  Moscow 2019-11-14     <NULL>
2             3  Storage Facility #3  Moscow 2012-07-05     <NULL>
3             4  Storage Facility #4  Moscow 2019-10-15     <NULL>
4             5  Storage Facility #5  Moscow 2015-06-17     <NULL>

In [33]:
df['date_close'] = pd.to_datetime(df['date_close'], format='%Y-%m-%dT%H:%M:%S.%fZ', errors='coerce')
df.head()

   warehouse_id                 name    city  date_open date_close
0             1  Storage Facility #1  Moscow 2019-06-06        NaT
1             2  Storage Facility #2  Moscow 2019-11-14        NaT
2             3  Storage Facility #3  Moscow 2012-07-05        NaT
3             4  Storage Facility #4  Moscow 2019-10-15        NaT
4             5  Storage Facility #5  Moscow 2015-06-17        NaT

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   warehouse_id  300 non-null    int64
 1   name          300 non-null    object
 2   city          300 non-null    object
 3   date_open     300 non-null    datetime64[ns]
 4   date_close    30 non-null     datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 11.8+ KB

In [40]:
now_date = datetime.now()
working_w = df[
    (df['date_open']<=now_date) & (df['date_close'].isna()|(df['date_close']>now_date))
]

In [41]:
working_w.head()

   warehouse_id                 name    city  date_open date_close
0             1  Storage Facility #1  Moscow 2019-06-06        NaT
1             2  Storage Facility #2  Moscow 2019-11-14        NaT
2             3  Storage Facility #3  Moscow 2012-07-05        NaT
3             4  Storage Facility #4  Moscow 2019-10-15        NaT
4             5  Storage Facility #5  Moscow 2015-06-17        NaT

In [43]:
result = working_w.groupby('city').size().reset_index(name='count')
result

               city  count
0            Moscow     88
1   Nizhny Novgorod      8
2       Novosibirsk     84
3  Saint Petersburg     80
4     Yekaterinburg     10

In [44]:
result = result[result['count']>=80].sort_values(by='count', ascending=False)
result

               city  count
0            Moscow     88
2       Novosibirsk     84
3  Saint Petersburg     80